Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.17/edc/PIC32CX1025SG61128.PIC
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RASR_A1" edc:nzwidth="0x20" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:impl="0x173FFF03" edc:_addr="0xE000EDA8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Region Enable"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Region Size"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:nzwidth="0x8" edc:desc="Sub-region disable"/>
            <edc:SFRFieldDef edc:cname="B" edc:nzwidth="0x1" edc:desc="Bufferable bit"/>
            <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Cacheable bit"/>
            <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="Shareable bit"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:nzwidth="0x3" edc:desc="TEX bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x3" edc:desc="Access Permission"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never Attribute"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RBAR_A2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x4" edc:desc="Region number"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Region number valid"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1B" edc:desc="Region base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RASR_A2" edc:nzwidth="0x20" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:impl="0x173FFF03" edc:_addr="0xE000EDB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Region Enable"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Region Size"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:nzwidth="0x8" edc:desc="Sub-region disable"/>
            <edc:SFRFieldDef edc:cname="B" edc:nzwidth="0x1" edc:desc="Bufferable bit"/>
            <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Cacheable bit"/>
            <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="Shareable bit"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:nzwidth="0x3" edc:desc="TEX bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x3" edc:desc="Access Permission"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never Attribute"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RBAR_A3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x4" edc:desc="Region number"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Region number valid"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1B" edc:desc="Region base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RASR_A3" edc:nzwidth="0x20" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:impl="0x173FFF03" edc:_addr="0xE000EDB8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Region Enable"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Region Size"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:nzwidth="0x8" edc:desc="Sub-region disable"/>
            <edc:SFRFieldDef edc:cname="B" edc:nzwidth="0x1" edc:desc="Bufferable bit"/>
            <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Cacheable bit"/>
            <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="Shareable bit"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:nzwidth="0x3" edc:desc="TEX bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x3" edc:desc="Access Permission"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never Attribute"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x34" edc:_addr="0xE000EDBC"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DHCSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------n-nnnn" edc:impl="0xFFFF002F" edc:_addr="0xE000EDF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C_SNAPSTALL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="DBGKEY" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="-15"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DCRSR" edc:nzwidth="0x20" edc:access="---------------w-----------wwwww" edc:impl="0x1001F" edc:_addr="0xE000EDF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DCRDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDF8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DEMCR" edc:nzwidth="0x20" edc:access="-------n----nnnn-----nnnnnnn---n" edc:impl="0x10F07F1" edc:_addr="0xE000EDFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
