Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.17/edc/PIC32CX1025SG61128.PIC
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="UR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x4200080C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MII" edc:nzwidth="0x1" edc:desc="MII Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="DCFGR" edc:nzwidth="0x20" edc:access="-------nnnnnnnnn----nnnnnn-nnnnn" edc:por="00000000000000100000011100000100" edc:mclr="00000000000000100000011100000100" edc:impl="0x1FF0FDF" edc:_addr="0x42000810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FBLDO" edc:nzwidth="0x5" edc:desc="Fixed Burst Length for DMA Data Operations:">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="00001: Always use SINGLE AHB bursts" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:desc="001xx: Attempt to use INCR4 AHB bursts (Default)" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:desc="01xxx: Attempt to use INCR8 AHB bursts" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:desc="1xxxx: Attempt to use INCR16 AHB bursts" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ESMA" edc:nzwidth="0x1" edc:desc="Endian Swap Mode Enable for Management Descriptor Accesses"/>
            <edc:SFRFieldDef edc:cname="ESPA" edc:nzwidth="0x1" edc:desc="Endian Swap Mode Enable for Packet Data Accesses"/>
            <edc:SFRFieldDef edc:cname="RXBMS" edc:nzwidth="0x2" edc:desc="Receiver Packet Buffer Memory Size Select">
              <edc:SFRFieldSemantic edc:cname="EIGHTH" edc:desc="RECEIVE_BUFFER_SIZE/8 Kbyte Memory Size" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="QUARTER" edc:desc="RECEIVE_BUFFER_SIZE/4 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="RECEIVE_BUFFER_SIZE/2 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="RECEIVE_BUFFER_SIZE Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXPBMS" edc:nzwidth="0x1" edc:desc="Transmitter Packet Buffer Memory Size Select"/>
            <edc:SFRFieldDef edc:cname="TXCOEN" edc:nzwidth="0x1" edc:desc="Transmitter Checksum Generation Offload Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRBS" edc:nzwidth="0x8" edc:desc="DMA Receive Buffer Size"/>
            <edc:SFRFieldDef edc:cname="DDRP" edc:nzwidth="0x1" edc:desc="DMA Discard Receive Packets"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TSR" edc:nzwidth="0x20" edc:access="-----------------------n-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x17F" edc:_addr="0x42000814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UBR" edc:nzwidth="0x1" edc:desc="Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="COL" edc:nzwidth="0x1" edc:desc="Collision Occurred"/>
            <edc:SFRFieldDef edc:cname="RLE" edc:nzwidth="0x1" edc:desc="Retry Limit Exceeded"/>
            <edc:SFRFieldDef edc:cname="TXGO" edc:nzwidth="0x1" edc:desc="Transmit Go"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:nzwidth="0x1" edc:desc="Transmit Frame Corruption Due to AHB Error"/>
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmit Complete"/>
            <edc:SFRFieldDef edc:cname="UND" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RBQB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFC" edc:_addr="0x42000818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Receive Buffer Queue Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBQB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFC" edc:_addr="0x4200081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Transmit Buffer Queue Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RSR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF" edc:_addr="0x42000820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="BNA" edc:nzwidth="0x1" edc:desc="Buffer Not Available"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x1" edc:desc="Frame Received"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:SFRFieldDef edc:cname="HNO" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="ISR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnn---nnnnn--nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFC7CFF" edc:_addr="0x42000824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:nzwidth="0x1" edc:desc="Management Frame Sent"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:nzwidth="0x1" edc:desc="Receive Complete"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:nzwidth="0x1" edc:desc="RX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:nzwidth="0x1" edc:desc="TX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:nzwidth="0x1" edc:desc="Retry Limit Exceeded"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:nzwidth="0x1" edc:desc="Transmit Frame Corruption Due to AHB Error"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:nzwidth="0x1" edc:desc="Transmit Complete"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:nzwidth="0x1" edc:desc="Pause Frame with Non-zero Pause Quantum Received"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:nzwidth="0x1" edc:desc="Pause Time Zero"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:nzwidth="0x1" edc:desc="Pause Frame Transmitted"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Received"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:nzwidth="0x1" edc:desc="TSU Seconds Register Increment"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:nzwidth="0x1" edc:desc="Enable RX LPI Indication"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:nzwidth="0x1" edc:desc="Wake On LAN"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:nzwidth="0x1" edc:desc="Tsu timer comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="IER" edc:nzwidth="0x20" edc:access="--wwwwwwwwwwww--wwwwww--wwwwwwww" edc:impl="0x3FFCFCFF" edc:_addr="0x42000828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:nzwidth="0x1" edc:desc="Management Frame Sent"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:nzwidth="0x1" edc:desc="Receive Complete"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:nzwidth="0x1" edc:desc="RX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:nzwidth="0x1" edc:desc="TX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:nzwidth="0x1" edc:desc="Retry Limit Exceeded or Late Collision"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:nzwidth="0x1" edc:desc="Transmit Frame Corruption Due to AHB Error"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:nzwidth="0x1" edc:desc="Transmit Complete"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:nzwidth="0x1" edc:desc="Pause Frame with Non-zero Pause Quantum Received"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:nzwidth="0x1" edc:desc="Pause Time Zero"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:nzwidth="0x1" edc:desc="Pause Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:nzwidth="0x1" edc:desc="External Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Received"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:nzwidth="0x1" edc:desc="TSU Seconds Register Increment"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:nzwidth="0x1" edc:desc="Enable RX LPI Indication"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:nzwidth="0x1" edc:desc="Wake On LAN"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:nzwidth="0x1" edc:desc="Tsu timer comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="IDR" edc:nzwidth="0x20" edc:access="--wwwwwwwwwwww--wwwwww--wwwwwwww" edc:impl="0x3FFCFCFF" edc:_addr="0x4200082C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:nzwidth="0x1" edc:desc="Management Frame Sent"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:nzwidth="0x1" edc:desc="Receive Complete"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:nzwidth="0x1" edc:desc="RX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:nzwidth="0x1" edc:desc="TX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:nzwidth="0x1" edc:desc="Retry Limit Exceeded or Late Collision"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:nzwidth="0x1" edc:desc="Transmit Frame Corruption Due to AHB Error"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:nzwidth="0x1" edc:desc="Transmit Complete"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:nzwidth="0x1" edc:desc="Pause Frame with Non-zero Pause Quantum Received"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:nzwidth="0x1" edc:desc="Pause Time Zero"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:nzwidth="0x1" edc:desc="Pause Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:nzwidth="0x1" edc:desc="External Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Received"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:nzwidth="0x1" edc:desc="TSU Seconds Register Increment"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:nzwidth="0x1" edc:desc="Enable RX LPI Indication"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:nzwidth="0x1" edc:desc="Wake On LAN"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:nzwidth="0x1" edc:desc="Tsu timer comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="IMR" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrr--rrrrrr--rrrrrrrr" edc:por="00111111111111111111111111111111" edc:mclr="00111111111111111111111111111111" edc:impl="0x3FFCFCFF" edc:_addr="0x42000830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:nzwidth="0x1" edc:desc="Management Frame Sent"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:nzwidth="0x1" edc:desc="Receive Complete"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:nzwidth="0x1" edc:desc="RX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:nzwidth="0x1" edc:desc="TX Used Bit Read"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:nzwidth="0x1" edc:desc="Retry Limit Exceeded"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:nzwidth="0x1" edc:desc="Transmit Frame Corruption Due to AHB Error"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:nzwidth="0x1" edc:desc="Transmit Complete"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:nzwidth="0x1" edc:desc="HRESP Not OK"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:nzwidth="0x1" edc:desc="Pause Frame with Non-zero Pause Quantum Received"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:nzwidth="0x1" edc:desc="Pause Time Zero"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:nzwidth="0x1" edc:desc="Pause Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:nzwidth="0x1" edc:desc="External Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Received"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:nzwidth="0x1" edc:desc="PTP Delay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:nzwidth="0x1" edc:desc="PTP Sync Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Received"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:nzwidth="0x1" edc:desc="PDelay Request Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:nzwidth="0x1" edc:desc="PDelay Response Frame Transmitted"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:nzwidth="0x1" edc:desc="TSU Seconds Register Increment"/>
            <edc:SFRFieldDef edc:cname="RXLPISBC" edc:nzwidth="0x1" edc:desc="Enable RX LPI Indication"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:nzwidth="0x1" edc:desc="Wake On Lan"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:nzwidth="0x1" edc:desc="Tsu timer comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="MAN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="PHY Data"/>
            <edc:SFRFieldDef edc:cname="WTN" edc:nzwidth="0x2" edc:desc="Write Ten"/>
            <edc:SFRFieldDef edc:cname="REGA" edc:nzwidth="0x5" edc:desc="Register Address"/>
            <edc:SFRFieldDef edc:cname="PHYA" edc:nzwidth="0x5" edc:desc="PHY Address"/>
            <edc:SFRFieldDef edc:cname="OP" edc:nzwidth="0x2" edc:desc="Operation"/>
            <edc:SFRFieldDef edc:cname="CLTTO" edc:nzwidth="0x1" edc:desc="Clause 22 Operation"/>
            <edc:SFRFieldDef edc:cname="WZO" edc:nzwidth="0x1" edc:desc="Write ZERO"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RPQ" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42000838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RPQ" edc:nzwidth="0x10" edc:desc="Received Pause Quantum"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TPQ" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000001111111111111111" edc:mclr="00000000000000001111111111111111" edc:impl="0xFFFF" edc:_addr="0x4200083C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TPQ" edc:nzwidth="0x10" edc:desc="Transmit Pause Quantum"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TPSF" edc:nzwidth="0x20" edc:access="n---------------------nnnnnnnnnn" edc:por="00000000000000000000001111111111" edc:mclr="00000000000000000000001111111111" edc:impl="0x800003FF" edc:_addr="0x42000840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TPB1ADR" edc:nzwidth="0xA" edc:desc="TX packet buffer address"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="ENTXP" edc:nzwidth="0x1" edc:desc="Enable TX partial store and forward operation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RPSF" edc:nzwidth="0x20" edc:access="n---------------------nnnnnnnnnn" edc:por="00000000000000000000001111111111" edc:mclr="00000000000000000000001111111111" edc:impl="0x800003FF" edc:_addr="0x42000844">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RPB1ADR" edc:nzwidth="0xA" edc:desc="RX packet buffer address"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="ENRXP" edc:nzwidth="0x1" edc:desc="Enable RX partial store and forward operation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="RJFML" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:por="00000000000000000011111111111111" edc:mclr="00000000000000000011111111111111" edc:impl="0x3FFF" edc:_addr="0x42000848">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FML" edc:nzwidth="0xE" edc:desc="Frame Max Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x34" edc:_addr="0x4200084C"/>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="HRB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000880">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Hash Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
