Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.17/edc/PIC32CX1025SG61128.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4300280E"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x43002810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43002812"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x43002814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43002816"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="SYNCBUSY" edc:nzwidth="0x10" edc:access="------rr--rrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x33F" edc:_addr="0x43002818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="CKEN0" edc:nzwidth="0x1" edc:desc="Clock Unit 0 Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="CKEN1" edc:nzwidth="0x1" edc:desc="Clock Unit 1 Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Tx Serializer Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Rx Serializer Enable Synchronization Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXDATA" edc:nzwidth="0x1" edc:desc="Tx Data Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="RXDATA" edc:nzwidth="0x1" edc:desc="Rx Data Synchronization Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4300281A"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="TXCTRL" edc:nzwidth="0x20" edc:access="------nnnnnnnnnnnnnn-nnnn--nnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF79C" edc:_addr="0x43002820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXDEFAULT" edc:nzwidth="0x2" edc:desc="Line Default Line when Slot Disabled">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Output Default Value is 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Output Default Value is 1" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HIZ" edc:desc="Output Default Value is high impedance" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXSAME" edc:nzwidth="0x1" edc:desc="Transmit Data when Underrun">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Zero data transmitted in case of underrun" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAME" edc:desc="Last data transmitted in case of underrun" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SLOTADJ" edc:nzwidth="0x1" edc:desc="Data Slot Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in slot" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in slot" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATASIZE" edc:nzwidth="0x3" edc:desc="Data Word Size">
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bits" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 bits" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="20" edc:desc="20 bits" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="18" edc:desc="18 bits" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bits" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="16C" edc:desc="16 bits compact stereo" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="8C" edc:desc="8 bits compact stereo" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WORDADJ" edc:nzwidth="0x1" edc:desc="Data Word Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in word" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in word" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTEND" edc:nzwidth="0x2" edc:desc="Data Formatting Bit Extension">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Extend with zeroes" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Extend with ones" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Extend with Most Significant Bit" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Extend with Least Significant Bit" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITREV" edc:nzwidth="0x1" edc:desc="Data Formatting Bit Reverse">
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Transfer Data Least Significant Bit (LSB) first" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLOTDIS0" edc:nzwidth="0x1" edc:desc="Slot 0 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS1" edc:nzwidth="0x1" edc:desc="Slot 1 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS2" edc:nzwidth="0x1" edc:desc="Slot 2 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS3" edc:nzwidth="0x1" edc:desc="Slot 3 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS4" edc:nzwidth="0x1" edc:desc="Slot 4 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS5" edc:nzwidth="0x1" edc:desc="Slot 5 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS6" edc:nzwidth="0x1" edc:desc="Slot 6 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS7" edc:nzwidth="0x1" edc:desc="Slot 7 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="MONO" edc:nzwidth="0x1" edc:desc="Mono Mode">
              <edc:SFRFieldSemantic edc:cname="STEREO" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MONO" edc:desc="Left channel data is duplicated to right channel" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Channels">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single DMA channel" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="One DMA channel per data channel" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="RXCTRL" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnnnnn-nnnn-n---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF7A3" edc:_addr="0x43002824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SERMODE" edc:nzwidth="0x2" edc:desc="Serializer Mode">
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Receive" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PDM2" edc:desc="Receive one PDM data on each serial clock edge" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x1" edc:desc="Clock Unit Selection">
              <edc:SFRFieldSemantic edc:cname="CLK0" edc:desc="Use Clock Unit 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLK1" edc:desc="Use Clock Unit 1" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOTADJ" edc:nzwidth="0x1" edc:desc="Data Slot Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in slot" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in slot" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATASIZE" edc:nzwidth="0x3" edc:desc="Data Word Size">
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bits" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 bits" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="20" edc:desc="20 bits" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="18" edc:desc="18 bits" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bits" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="16C" edc:desc="16 bits compact stereo" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="8C" edc:desc="8 bits compact stereo" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WORDADJ" edc:nzwidth="0x1" edc:desc="Data Word Formatting Adjust">
              <edc:SFRFieldSemantic edc:cname="RIGHT" edc:desc="Data is right adjusted in word" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEFT" edc:desc="Data is left adjusted in word" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTEND" edc:nzwidth="0x2" edc:desc="Data Formatting Bit Extension">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Extend with zeroes" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Extend with ones" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Extend with Most Significant Bit" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Extend with Least Significant Bit" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITREV" edc:nzwidth="0x1" edc:desc="Data Formatting Bit Reverse">
              <edc:SFRFieldSemantic edc:cname="MSBIT" edc:desc="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LSBIT" edc:desc="Transfer Data Least Significant Bit (LSB) first" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLOTDIS0" edc:nzwidth="0x1" edc:desc="Slot 0 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS1" edc:nzwidth="0x1" edc:desc="Slot 1 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS2" edc:nzwidth="0x1" edc:desc="Slot 2 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS3" edc:nzwidth="0x1" edc:desc="Slot 3 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS4" edc:nzwidth="0x1" edc:desc="Slot 4 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS5" edc:nzwidth="0x1" edc:desc="Slot 5 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS6" edc:nzwidth="0x1" edc:desc="Slot 6 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="SLOTDIS7" edc:nzwidth="0x1" edc:desc="Slot 7 Disabled for this Serializer"/>
            <edc:SFRFieldDef edc:cname="MONO" edc:nzwidth="0x1" edc:desc="Mono Mode">
              <edc:SFRFieldSemantic edc:cname="STEREO" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MONO" edc:desc="Left channel data is duplicated to right channel" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Channels">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single DMA channel" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="One DMA channel per data channel" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:nzwidth="0x1" edc:desc="Loop-back Test Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x43002828"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="TXDATA" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43002830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Sample Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="RXDATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43002834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Sample Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
