Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.17/edc/PIC32CX1025SG61128.PIC
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="CA0R" edc:nzwidth="0x20" edc:access="rrrr-rrrrrr-rrrrrrrrrrrrr-rrrrrr" edc:por="00100111111010000000000010000000" edc:mclr="00100111111010000000000010000000" edc:impl="0xF7EFFFBF" edc:_addr="0x46000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="TEOCLKF" edc:nzwidth="0x6" edc:desc="Timeout Clock Frequency">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0x3F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEOCLKU" edc:nzwidth="0x1" edc:desc="Timeout Clock Unit">
              <edc:SFRFieldSemantic edc:cname="KHZ" edc:desc="KHz" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MHZ" edc:desc="MHz" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASECLKF" edc:nzwidth="0x8" edc:desc="Base Clock Frequency">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0xFF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXBLKL" edc:nzwidth="0x2" edc:desc="Max Block Length">
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ED8SUP" edc:nzwidth="0x1" edc:desc="8-bit Support for Embedded Device">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="8-bit Bus Width not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="8-bit Bus Width Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA2SUP" edc:nzwidth="0x1" edc:desc="ADMA2 Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="ADMA2 not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="ADMA2 Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSSUP" edc:nzwidth="0x1" edc:desc="High Speed Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="High Speed not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="High Speed Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDMASUP" edc:nzwidth="0x1" edc:desc="SDMA Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="SDMA not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="SDMA Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRSUP" edc:nzwidth="0x1" edc:desc="Suspend/Resume Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Suspend/Resume not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Suspend/Resume Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V33VSUP" edc:nzwidth="0x1" edc:desc="Voltage Support 3.3V">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="3.3V Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="3.3V Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V30VSUP" edc:nzwidth="0x1" edc:desc="Voltage Support 3.0V">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="3.0V Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="3.0V Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V18VSUP" edc:nzwidth="0x1" edc:desc="Voltage Support 1.8V">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="1.8V Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="1.8V Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SB64SUP" edc:nzwidth="0x1" edc:desc="64-Bit System Bus Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="32-bit Address Descriptors and System Bus" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="64-bit Address Descriptors and System Bus" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASINTSUP" edc:nzwidth="0x1" edc:desc="Asynchronous Interrupt Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Asynchronous Interrupt not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Asynchronous Interrupt supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLTYPE" edc:nzwidth="0x2" edc:desc="Slot Type">
              <edc:SFRFieldSemantic edc:cname="REMOVABLE" edc:desc="Removable Card Slot" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EMBEDDED" edc:desc="Embedded Slot for One Device" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="CA1R" edc:nzwidth="0x20" edc:access="--------rrrrrrrr--r-rrrr-rrr-rrr" edc:por="00000000000000000000000001110000" edc:mclr="00000000000000000000000001110000" edc:impl="0xFF2F77" edc:_addr="0x46000044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDR50SUP" edc:nzwidth="0x1" edc:desc="SDR50 Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="SDR50 is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="SDR50 is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDR104SUP" edc:nzwidth="0x1" edc:desc="SDR104 Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="SDR104 is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="SDR104 is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDR50SUP" edc:nzwidth="0x1" edc:desc="DDR50 Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="DDR50 is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="DDR50 is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRVASUP" edc:nzwidth="0x1" edc:desc="Driver Type A Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Driver Type A is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Driver Type A is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DRVCSUP" edc:nzwidth="0x1" edc:desc="Driver Type C Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Driver Type C is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Driver Type C is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DRVDSUP" edc:nzwidth="0x1" edc:desc="Driver Type D Support">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Driver Type D is Not Supported" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Driver Type D is Supported" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCNTRT" edc:nzwidth="0x4" edc:desc="Timer Count for Re-Tuning">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Re-Tuning Timer disabled" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1S" edc:desc="1 second" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="2S" edc:desc="2 seconds" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="4S" edc:desc="4 seconds" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="8S" edc:desc="8 seconds" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="16S" edc:desc="16 seconds" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="32S" edc:desc="32 seconds" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="64S" edc:desc="64 seconds" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="128S" edc:desc="128 seconds" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="256S" edc:desc="256 seconds" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="512S" edc:desc="512 seconds" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="1024S" edc:desc="1024 seconds" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information from other source" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSDR50" edc:nzwidth="0x1" edc:desc="Use Tuning for SDR50">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="SDR50 does not require tuning" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="SDR50 requires tuning" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKMULT" edc:nzwidth="0x8" edc:desc="Clock Multiplier">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Clock Multiplier is Not Supported" edc:when="(field &amp; 0xFF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="MCCAR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x46000048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="MAXCUR33V" edc:nzwidth="0x8" edc:desc="Maximum Current for 3.3V">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="4MA" edc:desc="4mA" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8MA" edc:desc="8mA" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="12MA" edc:desc="12mA" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXCUR30V" edc:nzwidth="0x8" edc:desc="Maximum Current for 3.0V">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="4MA" edc:desc="4mA" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8MA" edc:desc="8mA" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="12MA" edc:desc="12mA" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXCUR18V" edc:nzwidth="0x8" edc:desc="Maximum Current for 1.8V">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="4MA" edc:desc="4mA" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8MA" edc:desc="8mA" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="12MA" edc:desc="12mA" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4600004C"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="FERACES" edc:nzwidth="0x10" edc:access="--------w--wwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x9F" edc:_addr="0x46000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ACMD12NE" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD12 Not Executed">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDTEO" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDCRC" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEND" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDIDX" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMDNI" edc:nzwidth="0x1" edc:desc="Force Event for Command Not Issued By Auto CMD12 Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="FEREIS" edc:nzwidth="0x10" edc:access="---w--wwwwwwwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x13FF" edc:_addr="0x46000052">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:nzwidth="0x1" edc:desc="Force Event for Command Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:nzwidth="0x1" edc:desc="Force Event for Command CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:nzwidth="0x1" edc:desc="Force Event for Command End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x1" edc:desc="Force Event for Command Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:nzwidth="0x1" edc:desc="Force Event for Data Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:nzwidth="0x1" edc:desc="Force Event for Data CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:nzwidth="0x1" edc:desc="Force Event for Data End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:nzwidth="0x1" edc:desc="Force Event for Current Limit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="Force Event for Auto CMD Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:nzwidth="0x1" edc:desc="Force Event for ADMA Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:nzwidth="0x1" edc:desc="Force Event for Boot Acknowledge Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Interrupt" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Interrupt is generated" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="AESR" edc:nzwidth="0x8" edc:access="-----rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x46000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ERRST" edc:nzwidth="0x2" edc:desc="ADMA Error State">
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="ST_STOP (Stop DMA)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FDS" edc:desc="ST_FDS (Fetch Descriptor)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TFR" edc:desc="ST_TFR (Transfer Data)" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LMIS" edc:nzwidth="0x1" edc:desc="ADMA Length Mismatch Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x46000055"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="ASAR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x46000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ADMASA" edc:nzwidth="0x20" edc:desc="ADMA System Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
